# Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят и сколько между ними находится букв.

b1 = input('Введите первую букву: ')
b2 = input('Введите вторую букву: ')
d1 = ord(b1)
d2 = ord(b2)

# для английского алфавита
# 65-90 = A, B, C, D...
if 64 < d1 < 91:
    d1_poz = d1 - 64
if 64 < d2 < 91:
    d2_poz = d2 - 64
# 97 - 122 = a, b, c, d...
if 96 < d1 < 123:
    d1_poz = d1 - 96
if 96 < d2 < 123:
    d2_poz = d2 - 96

# для русского алфавита
# буква ё
if d1 == 1105 or d1 == 1025:
    d1_poz = 7
if d2 == 1105 or d2 == 1025:
    d2_poz = 7
# 1040 - 1071 = А, Б, В, Г...
if 1039 < d1 < 1046:
    d1_poz = d1 - 1039
if 1046 < d1 < 1072:
    d1_poz = d1 - 1038
if 1039 < d2 < 1046:
    d2_poz = d2 - 1039
if 1046 < d2 < 1072:
    d2_poz = d2 - 1038
# 1072 - 1103 = а, б, в, г, д, е ...
if 1071 < d1 < 1078:
    d1_poz = d1 - 1071
if 1077 < d1 < 1104:
    d1_poz = d1 - 1070
if 1071 < d2 < 1078:
    d2_poz = d2 - 1071
if 1077 < d2 < 1104:
    d2_poz = d2 - 1070

print(f'Первая буква находится на {d1_poz} месте в алфавите')
print(f'Вторая буква находится на {d2_poz} месте в алфавите')
if d1_poz - d2_poz:
    print(f'Между ними находится {abs(d1_poz - d2_poz) - 1} букв(-а)')
else:
    print(f'Между ними находится 0 букв')
